Repository: shrutiiiiin/SmartFasal
Catalog: lib/l10n/app_*.arb
Languages: hi, mr, pa, ta, te

# selectCrops
source: Select Your Crops
hi: अपनी फसलें चुनें
mr: आपल्या पिकांची निवड करा
pa: ਆਪਣੀਆਂ ਫਸਲਾਂ ਦੀ ਚੋਣ ਕਰੋ
ta: உங்கள் பயிர்களைத் தேர்ந்தெடுக்கவும்
te: మీ పంటలను ఎంచుకోండి

# updateCrops
source: 🌱⭐ You can update this list anytime as you grow more crops
hi: 🌱⭐ जैसे ही आप और फसलें उगाते हैं, आप इस सूची को कभी भी अपडेट कर सकते हैं
mr: 🌱⭐ तुम्ही अधिक पिके घेतल्यावर तुम्ही ही यादी कधीही अद्ययावत करू शकता
pa: 🌱⭐ ਤੁਸੀਂ ਇਸ ਸੂਚੀ ਨੂੰ ਕਿਸੇ ਵੀ ਸਮੇਂ ਅੱਪਡੇਟ ਕਰ ਸਕਦੇ ਹੋ ਕਿਉਂਕਿ ਤੁਸੀਂ ਹੋਰ ਫ਼ਸਲਾਂ ਉਗਾਉਂਦੇ ਹੋ
ta: 🌱⭐ நீங்கள் அதிக பயிர்களை வளர்க்கும்போது இந்தப் பட்டியலை எப்போது வேண்டுமானாலும் புதுப்பிக்கலாம்
te: 🌱⭐ మీరు మరిన్ని పంటలను పెంచే కొద్దీ ఈ జాబితాను నవీకరించవచ్చు

source: Next Step
hi: अगला कदम
mr: पुढील चरण
pa: ਅਗਲਾ ਕਦਮ
ta: அடுத்த படி
te: తదుపరి దశ

# appName
source: Smart Fasal🌱
hi: स्मार्ट फसल🌱
mr: स्मार्ट फसल🌱
pa: ਸਮਾਰਟ ਫਾਸਲ🌱
ta: ஸ்மார்ட் ஃபசல்🌱
te: స్మార్ట్ ఫసల్ 🌱

source: Analysis
hi: विश्लेषण
mr: विश्लेषण
pa: ਵਿਸ਼ਲੇਸ਼ਣ
ta: பகுப்பாய்வு
te: విశ్లేషణ

source: ChatBot
hi: चैटबॉट
mr: चॅटबॉट
pa: ਚੈਟਬੋਟ
ta: அரட்டை போட்
te: చాట్ బాట్

# scheme
source: Marketplace
hi: बाजार
mr: बाजारपेठ
pa: ਬਾਜ਼ਾਰ
ta: சந்தை
te: మార్కెట్ప్లేస్

# ai
source: Fertilizer Health Scheduling
hi: एआई शेड्यूलिंग
mr: एआय शेड्युलिंग
pa: ਖਾਦ ਸਿਹਤ ਸਮਾਂ-ਸਾਰਣੀ
ta: NPK చరిత్ర
te: NPK வரலாறு

source: Soil Moisture %
hi: मिट्टी की नमी
mr: माती ओलावा %
pa: ਮਿੱਟੀ ਦੀ ਨਮੀ %
ta: மண்ணின் ஈரப்பதம்%
te: మంటి తేమ %

source: Temperature
hi: तापमान
mr: तापमान
pa: ਤਾਪਮਾਨ
ta: வெப்பநிலை
te: సాంప్రదాయం

# fertilizerLevel
source: Ferilizer Level
hi: उर्वरक स्तर
mr: पाण्याची पातळी
pa: ਖਾਦ ਦਾ ਪੱਧਰ
ta: உர நிலை
te: ఎరువు స్థాయి

source: pH Level
hi: पीएच स्तर
mr: पीएच पातळी
pa: pH ਪੱਧਰ
ta: pH நிலை
te: pH స్థాయి

# favorable
source: ✅ Favorable for crops
hi: ✅ फसलों के लिए अनुकूल
mr: ✅ पिकांसाठी अनुकूल
pa: ✅ ਫਸਲਾਂ ਲਈ ਅਨੁਕੂਲ
ta: ✅பயிர்களுக்கு சாதகமானது
te: ✅ పంటలకు అనుకూలం

# notfavorable
source: ⚠️ Not favorable for crops
hi: ⚠️फसलों के लिए अनुकूल नहीं
mr: ⚠️पिकांसाठी अनुकूल नाही
pa: ⚠️ ਫਸਲਾਂ ਲਈ ਅਨੁਕੂਲ ਨਹੀਂ
ta: ⚠️ பயிர்களுக்கு சாதகமாக இல்லை
te: ⚠️ పంటలకు అనుకూల కాదు

# continuebutton
source: Continue
hi: जारी रखना
mr: चालू ठेवा
pa: ਜਾਰੀ ਰੱਖੋ
ta: தொடரவும்
te: కొనసాగించు

source: Welcome to Smart Fasal🌱
hi: स्मार्ट फसल में आपका स्वागत है
mr: Smart Fasal🌱 मध्ये आपले स्वागत आहे
pa: Smart Fasal🌱 ਵਿੱਚ ਤੁਹਾਡਾ ਸੁਆਗਤ ਹੈ
ta: Smart Fasal🌱க்கு வரவேற்கிறோம்
te: స్మార్ట్ ఫసల్ 🌱 へ వ స్వాగతం

source: Select Language
hi: भाषा चुने
mr: भाषा निवडा
pa: ਭਾਸ਼ਾ ਚੁਣੋ
ta: மொழியைத் தேர்ந்தெடுக்கவும்
te: భాషను ఎంచుకోండి

# fertilizer_status
source: Fertilizer Healthy ✅
hi: उर्वरक स्वस्थ ✅
mr: खते आरोग्यदायी ✅
pa: ਖਾਦ ਸਿਹਤਮੰਦ ✅
ta: உரம் ஆரோக்கியமானது

# chatBot_screen
source: Welcome, Let's start chatting with Agribot!
hi: आपका स्वागत है, आइए एग्रीबॉट के साथ बातचीत शुरू करें!
mr: स्वागत आहे, चला Agribot सह चॅटिंग सुरू करूया!
pa: ਜੀ ਆਇਆਂ ਨੂੰ, ਆਓ ਐਗਰੀਬੋਟ ਨਾਲ ਗੱਲਬਾਤ ਸ਼ੁਰੂ ਕਰੀਏ!
ta: வரவேற்கிறோம், அக்ரிபோட் உடன் அரட்டை அடிப்போம்!

# fertilizer_healthsection
source: Ferilizer Health Schedule
hi: उर्वरक स्वास्थ्य अनुसूची
mr: खत हिस्टोग्राफिक डेटा
pa: ਖਾਦ ਸਿਹਤ ਅਨੁਸੂਚੀ
ta: உர வரலாற்று தரவு
te: ఎరువుల హిస్టోగ్రాఫిక్ డేటా

# fertilizer_health
source: Fertlizer Health
hi: उर्वरक स्वास्थ्य
mr: उर्वरक हिस्टोग्राफिक डेटा
pa: ਖਾਦ ਦੀ ਸਿਹਤ
ta: உர வரலாற்று தரவு
te: ఎరువుల హిస్టోగ్రాఫిక్ డేటా

source: Manual
hi: नियमावली
mr: मॅन्युअल
pa: ਮੈਨੁਅਲ
ta: கையேடு

source: Progress
hi: प्रगति
mr: प्रगती
pa: ਤਰੱਕੀ
ta: முன்னேற்றம்

# fertilizer_health_healthy
source: Fertlizer health (healthy)
hi: उर्वरक स्वास्थ्य (स्वस्थ)
mr: खत आरोग्य (निरोगी)
pa: ਖਾਦ ਦੀ ਸਿਹਤ ਸਿਹਤਮੰਦ
ta: உர ஆரோக்கியம் (ஆரோக்கியமான)

# organic_matter
source: Organic Matter Low! ⚠️
hi: कार्बनिक पदार्थ कम! ⚠️
mr: सेंद्रिय पदार्थ कमी! ⚠️
pa: ਜੈਵਿਕ ਪਦਾਰਥ ਘੱਟ! ⚠️
ta: ஆர்கானிக் பொருள் குறைவு! ⚠️

# next_schedule
source: Next scheduled checkup in 2 weeks.
hi: अगला निर्धारित चेकअप 2 सप्ताह में।
mr: पुढील नियोजित तपासणी 2 आठवड्यात.

source: Usage
hi: प्रयोग
mr: वापर

# yield_inc
source: Yield Increase
hi: उपज में वृद्धि
mr: उत्पन्न वाढ

source: Fertilizer Efficiency
hi: उर्वरक दक्षता
mr: खत कार्यक्षमता

# yield
source: 5x yield
hi: 5x उपज
mr: 5x उत्पन्न

source: Chat with AgriBot
hi: एग्री बॉट के साथ चैट करें
mr: आगरी बॉटशी गप्पा मारा
pa: AgriBot ਨਾਲ ਗੱਲਬਾਤ ਕਰੋ

source: Profile
hi: प्रोफ़ाइल
mr: प्रोफाइल
pa: ਪ੍ਰੋਫਾਈਲ
ta: சுயவிவரம்

source: More Options
hi: अधिक विकल्प
mr: अधिक पर्याय
pa: ਹੋਰ ਵਿਕਲਪ
ta: மேலும் விருப்பங்கள்

# phoneLogin
source: Please Enter your Phone number to be a part of smart fasal
hi: स्मार्ट फसल का हिस्सा बनने के लिए कृपया अपना फ़ोन नंबर दर्ज करें
mr: चला तुमचा फसल स्मार्ट करूया
pa: ਕਿਰਪਾ ਕਰਕੇ ਸਮਾਰਟ ਫੈਸਲਸ਼ਨ ਦਾ ਹਿੱਸਾ ਬਣਨ ਲਈ ਆਪਣਾ ਫ਼ੋਨ ਨੰਬਰ ਦਰਜ ਕਰੋ
ta: ஸ்மார்ட் ஃபசலின் ஒரு பகுதியாக இருக்க உங்கள் தொலைபேசி எண்ணை உள்ளிடவும்
te: స్మార్ట్ ఫసల్‌లో భాగం కావడానికి దయచేసి మీ ఫోన్ నంబర్‌ను నమోదు చేయండి

# enterPhoneNumber
source: Enter your phone number
hi: अपना फोन नंबर डालें
mr: तुमचा फोन नंबर टाका
pa: ਆਪਣਾ ਫ਼ੋਨ ਨੰਬਰ ਦਾਖਲ ਕਰੋ
ta: உங்கள் தொலைபேசி எண்ணை உள்ளிடவும்
te: మీ ఫోన్ నంబర్‌ను నమోదు చేయండి

source: Send OTP
hi: ओटीपी भेजें
mr: ओटीपी पाठवा
pa: OTP ਭੇਜੋ
ta: OTP அனுப்பவும்
te: OTPని పంపండి

# enterOtp
source: Enter your OTP
hi: अपना ओटीपी दर्ज करें
mr: तुमचा ओटीपी टाका
pa: ਆਪਣਾ OTP ਦਾਖਲ ਕਰੋ
ta: உங்கள் OTP ஐ உள்ளிடவும்
te: మీ OTPని నమోదు చేయండి

# verifyOtp
source: Let's Smartify your Fasal🌱
hi: आइए आपके फसल को स्मार्ट बनाएं🌱
mr: चला तुमचा फसल स्मार्ट करूया
pa: ਆਓ ਆਪਣੇ ਫਾਸਲ ਨੂੰ ਸਮਾਰਟ ਕਰੀਏ
ta: உங்கள் ஃபசலை ஸ்மார்ட்டை செய்வோம்🌱
te: మీ ఫసల్🌱ని స్మార్ట్‌ఫై చేద్దాం

# handleFertilizerCalc
source: Ferilizer Calculation
mr: खत गणना
pa: ਖਾਦ ਦੀ ਗਣਨਾ
ta: உரக் கணக்கீடு
te: ఎరువులు గణన
